СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ВедомостьУчетаЗадолженностей/ВедомостьУчетаЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаЗадолженностей</name>
  <basedOn>Document.ГрафикЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УспешныеПересдачи</registerRecords>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВозникшихЗадолженностей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВозникновения</name>
      <type>
        <types>EnumRef.ОписаниеПричины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУспешныхПересдач</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗадолженности</name>
      <type>
        <types>EnumRef.НаименованиеСтатуса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ВедомостьУчетаЗадолженностей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ГрафикЛиквидацииЗадолженностей") Тогда
		// Заполнение шапки
		Семестр = ДанныеЗаполнения.Семестр;
		Для Каждого ТекСтрокаРасписаниеПересдач Из ДанныеЗаполнения.РасписаниеПересдач Цикл
			НоваяСтрока = Долги.Добавить();
			НоваяСтрока.Студент = ТекСтрокаРасписаниеПересдач.Студент;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколЗаседанияКомиссии") Тогда
		// Заполнение шапки
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
